// ক্লাস সেভের এর ফাইনাল এক্সাম এ তুমি ফার্স্ট হয়েছো। তোমার বন্ধু আলিয়া, ডালিয়া, সালিয়া, মালিয়া, লিলিয়া আর জ্বালাইয়া - তাদের grade তুমি জানো না। তবে তাদের নম্বর জানো. আলিয়া 95 পেয়েছে, ডালিয়া 66 পেয়েছে, সালিয়া 80 পেয়েছে, মালিয়া পেয়েছে 59, লিলিয়া পেয়েছে 47, জ্বালাইয়া পেয়েছে 77। তুমি JS code দিয়ে তাদের grade বের করে দিতে পারবে?

// // ---------------------------------------------

var mark = 101;

// ১) যারা ৫০ এর নিচে পেয়েছে, তাদের grade F.
if (mark < 50) {
    console.log('F');
}
// ২) যারা ৫০ বা তার উপরে পেয়েছে, অথবা ৬০ এর নিচে পেয়েছে, তাদের grade D.
else if (mark < 60 && mark >= 50) {
    console.log('D');
}
// ৩) যারা ৬০ বা তার উপরে পেয়েছে, অথবা ৭০ এর নিচে পেয়েছে, তাদের grade C.
else if (mark < 70 && mark >= 60) {
    console.log('C');
}
// ৪) যারা ৭০ বা তার উপরে পেয়েছে, অথবা ৮০ এর নিচে পেয়েছে, তাদের grade B.
else if (mark < 80 && mark >= 70) {
    console.log('B');
}
// ৫) যারা ৮০ বা তার উপরে পেয়েছে, অথবা ৯০ এর নিচে পেয়েছে, তাদের grade A.
else if (mark < 90 && mark >= 80) {
    console.log('A');
}
// ৬) যারা ৯০ বা তার উপরে পেয়েছে, তাদের grade A+.
else if (mark >= 90 && mark <= 100) {
    console.log(' Get A+');
}
else {
    console.log(mark, ' over number');
}


// // -----------------------------------------------------------



// প্রাকটিস প্রব্লেম-২:

// তাড়াহুড়া করে স্কুলের জন্য বের হচ্ছ কিন্তু রাস্তা পার হওয়ার সময় দেখলে, ট্রাফিক সিগন্যাল লাল রং। এই অবস্থায় যদি তুমি রাস্তা পার হওয়ার চেষ্টা কর, তাহলে ডেঞ্জার হতে পারে। যদি হলুদ রং হয় তাহলে তোমার থেমে যাওয়া উচিত। আর যদি ট্রাফিক সিগন্যাল গ্রিন হয় তাহলে তোমার রাস্তা পার হওয়া উচিত। তাই একটা কোড লিখে ফেলো। যেখানে আমরা signal নামে একটা ভেরিয়েবল থাকবে। সেটার মান green, yellow বা red হতে পারে। সেই অনুসারে ডিফারেন্ট ডিফারেন্ট কাজ হবে। তো, সেই কোড ফটাফট লিখে ফেলো। 

var signal = ['red', 'yellow', 'green']

var signal = signal[1];

if (signal == 'red') {
    console.log("It is Danger for crosing road. Don't do that..");
}
else if (signal == 'yellow') {
    console.log(" Wait for a While .. It's better for you...");
}
else if (signal == 'green') {
    console.log(" Ok . Baby !!! You can go Now... ");
}
else {
    console.log('Signal chor a niche ');
}